import { HttpClient } from '@angular/common/http';
import { Component, inject, OnInit } from '@angular/core';
import { DomSanitizer, SafeHtml } from '@angular/platform-browser';

@Component({
  selector: 'app-lex-news',
  imports: [],
  templateUrl: './lex-news.component.html',
  styleUrl: './lex-news.component.scss',
})
export class LexNewsComponent implements OnInit {
  newsList = [
    {
      title: `Микромолия ташкилотлари томонидан исломий молиялаштиришга оид хизматларни кўрсатиш тартиби тўғрисидаги низомни тасдиқлаш ҳақида`,
      subtitle: `Ўзбекистон Республикаси Марказий банки бошқарувининг қарори, 26.07.2024 йилда рўйхатдан ўтган, рўйхат рақами 3536`,
    },
    {
      title: `Ўзбекистон Республикаси бухгалтерия ҳисобининг миллий стандарти (8-сонли БҲМС) “Консолидатсиялашган молиявий ҳисоботлар ва шу’ба хўжалик жамиятларига инвестициялар ҳисоби”ни тасдиқлаш ҳақида`,
      subtitle: `Ўзбекистон Республикаси иқтисодиёт ва молия вазирининг буйруғи, 26.07.2024 йилда рўйхатдан ўтган, рўйхат рақами 3537`,
    },
    {
      title: `Ўзбекистон Республикаси Ҳукуматининг айрим қарорларига республика ижро этувчи ҳокимият органларининг номларини ўзаро мувофиқлаштиришни назарда тутувчи ўзгартириш ва қўшимчалар киритиш тўғрисида`,
      subtitle: `Ўзбекистон Республикаси Вазирлар Маҳкамасининг қарори, 25.07.2024 йилда`,
    },
    {
      title: `Ўзбекистон Республикаси бухгалтерия ҳисобининг миллий стандарти (11-сонли БҲМС) “Илмий-тадқиқот ва тажриба-конструкторлик ишлари бўйича харажатлар”ни тасдиқлаш ҳақида`,
      subtitle: `Ўзбекистон Республикаси иқтисодиёт ва молия вазирининг буйруғи, 25.07.2024 йилда рўйхатдан ўтган, рўйхат рақами 3535`,
    },
    {
      title: `Микромолия ташкилотлари томонидан исломий молиялаштиришга оид хизматларни кўрсатиш тартиби тўғрисидаги низомни тасдиқлаш ҳақида`,
      subtitle: `Ўзбекистон Республикаси Марказий банки бошқарувининг қарори, 26.07.2024 йилда рўйхатдан ўтган, рўйхат рақами 3536`,
    },
    {
      title: `Ўзбекистон Республикаси бухгалтерия ҳисобининг миллий стандарти (8-сонли БҲМС) “Консолидатсиялашган молиявий ҳисоботлар ва шу’ба хўжалик жамиятларига инвестициялар ҳисоби”ни тасдиқлаш ҳақида`,
      subtitle: `Ўзбекистон Республикаси иқтисодиёт ва молия вазирининг буйруғи, 26.07.2024 йилда рўйхатдан ўтган, рўйхат рақами 3537`,
    },
  ];
  private sanitizer = inject(DomSanitizer);
  icon!: SafeHtml;
  doc!: SafeHtml;
  private http = inject(HttpClient);
  ngOnInit(): void {
    this.loadSvg('arrow-up-r.svg', 'icon');
    this.loadSvg('doc.svg', 'doc');
  }
  private loadSvg(filename: string, target: 'icon' | 'doc'): void {
    const path = `images/icons/${filename}`;
    this.http.get(path, { responseType: 'text' }).subscribe((svg) => {
      const safe = this.sanitizer.bypassSecurityTrustHtml(svg);
      this[target] = safe;
    });
  }
}
